{
  "sidebar": "## Sidebar\nLeft navigation panel with current path, lab title, documentation access, and bottom links (Home, Help, User Account).",
  "general": "## General Overview\nDark blue data science platform with sidebar navigation, multi-project support, role-based access, and credit-based resources.",
  "chat": "## AI Chat\nCollapsible right-side AI assistant tab for contextual help and platform navigation.",
  "page_selection": "## Page Navigation Sidebar\nSecondary sidebar for navigating between main sections (Home, Library, Team, Activity, Notebooks, Explore, Build, Experiment, Admin).",
  "home": "## Home Page\nProject dashboard with title, description, metadata, team avatars, and edit functionality.",
  "library": "## Library Page\nThree tabs displaying saved project entities: Experimental Data, Models, and Simulations.",
  "project_team": "## Project Team Page\nTeam member management page where admins can add/remove project members.",
  "activity": "## Activity Page\nRecent project activities in table format with multiple tabs and neuroscience simulation tracking.",
  "notebooks": "## Notebooks Page\nScientific data management with searchable, sortable tables for computational neuroscience research.",
  "explore": "## Explore Section\n3D brain atlas interface with hierarchical region selector on the left sidebar, neuron counts, and data visualization.",
  "explore-morphology": "## Explore Morphology List Page\nNeuron morphology browser with hierarchical regions, preview diagrams, and specimen metadata.",
  "explore-morphology-details": "## Morphology Details Page\nDetailed view of individual morphology cells with 3D visualization and metadata.",
  "explore-electrophysiology": "## Electrophysiology List Page\nElectrophysiology data browser with chart previews and filtering by brain region.",
  "explore-electrophysiology-details": "## Electrophysiology Details Page\nDetailed electrophysiology viewer with stimulus-response plots and interactive analysis.",
  "explore-neuron-density": "## Neuron Density List Page\nNeuron density data table with morphology types, measurements, and contributor information.",
  "explore-neuron-density-details": "## Neuron Density Details Page\nIndividual neuron density record with methodology description and statistical data.",
  "explore-bouton-density": "## Bouton Density List Page\nBouton density measurements table with statistical values and morphological identifiers.",
  "explore-bouton-density-details": "## Bouton Density Details Page\nDetailed bouton density record with statistical measurements and metadata.",
  "explore-synapse-per-connection": "## Synapse Per Connection List Page\nSynaptic connection data showing anatomical connectivity with statistical measurements.",
  "explore-synapse-per-connection-details": "## Synapse Per Connection Details Page\nIndividual synapse connection record with bidirectional brain region data.",
  "build": "## Build Page\nModel creation interface organized by scales (Subcellular, Cellular, Circuit, System). Only Single Neuron currently available.",
  "build-me-model": "## Build ME Model Page\nForm to create new single neuron model with name, description, and brain region fields.",
  "build-me-model-details": "## Build ME Model Details Page\nModel configuration page showing metadata and selection areas for m-model and e-model components.",
  "build-me-model-morphology-selection": "## Build ME Model - Morphology Selection Page\nMorphology selection interface with brain region navigation and searchable model table.",
  "build-me-model-e-model-selection": "## Build ME Model - E-Model Selection Page\nElectrical model selection with brain region filtering and model performance scores.",
  "build-synaptome": "## Build Synaptome Page\nForm to create new synaptome model with basic metadata fields.",
  "build-synaptome-details": "## Build Synaptome Details Page\nDetailed synaptome model configuration page (empty description provided).",
  "experiment": "## Experiment Page\nExperiment launcher with model scale grid, available options (Single Neuron, Synaptome, Small Microcircuit), and results table.",
  "admin": "## Admin Page\nProject management with expandable tabs for Costs (activity log with credits) and Danger Zone (delete project)."
}
